{"id":"guide/events/field-sync-redraw","title":"Field Sync / Field Redraw","contents":"<h1 id=\"field-sync--form-redraw\"><a href=\"#field-sync--form-redraw\" aria-hidden><span class=\"icon icon-link\"></span></a>Field Sync / Form Redraw</h1>\n<p>As explained and demonstrated in the <a href=\"../before-render\">beforeRender</a> event chapter,\n<code class=\"language-text\">NFormRecordRef</code> instances control the rendering output of a form field.</p>\n<p>The event is emitted on first load but also when the <code class=\"language-text\">redraw()</code> method is invoked, so it means that the <code class=\"language-text\">redraw()</code> method is way to update data required for form control rendering or if an event changes the type of it which will result in a completely different component rendered for that form control.</p>\n<p>In fact, there are 2 ways to update a <code class=\"language-text\">NFormRecordRef</code> instance, a redraw or a field sync.</p>\n<h2 id=\"redraw\"><a href=\"#redraw\" aria-hidden><span class=\"icon icon-link\"></span></a>Redraw</h2>\n<p>Perform A complete redraw that will re-render all of the controls in the form and emit the <strong>beforeRender</strong> event. This approach is like a re-init to the rendered form.</p>\n<h2 id=\"field-sync\"><a href=\"#field-sync\" aria-hidden><span class=\"icon icon-link\"></span></a>Field Sync</h2>\n<p>A field sync is more subtle and involves re-rendering of a single form control, it does not emit any events and does not apply any asynchronous logic.</p>\n<h2 id=\"what-should-i-use\"><a href=\"#what-should-i-use\" aria-hidden><span class=\"icon icon-link\"></span></a>What should I use</h2>\n<p>A redraw emit events, so if you have a UI blocker component that shows when the form is rendering and you know that async operations will run then use it.</p>\n<p>A field sync will not fire events so it might be handy when updating the type of a component or some metadata related to it.</p>\n<p>It can also be used for async operations but you will need to block the UI manually or block that specific control manually.</p>\n<p>Sometimes, especially when change detection is not strict, changing just data does not require a redraw or a field sync.</p>\n<p>In the example below the <strong>superPower</strong> field is being rendered with the <code class=\"language-text\">select</code> visual type, you can toggle the rendered component between select and radio and click on the buttons to see how each approach effects the UI</p>\n<div pbl-example-view=\"pbl-field-sync-redraw-example\"></div>\n"}